WebAPICba/bin/Debug/net6.0/appsettings.json

{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "ConnectionStrings": {
    "DefaultConnection": "Server=.;Database=ExchangeRateDb;Trusted_Connection=True;MultipleActiveResultSets=true"
  },
  "SoapTemplates": {
    "ExchangeRatesByDate": "<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><ExchangeRatesByDate xmlns='http://www.cba.am/'><date>{0:yyyy-MM-dd}</date></ExchangeRatesByDate></soap:Body></soap:Envelope>"
  }
}